{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "Normal",
    "1": "Depression",
    "2": "Anxiety",
    "3": "Stress",
    "4": "Suicidal",
    "5": "Bi-Polar",
    "6": "Other"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Anxiety": 2,
    "Bi-Polar": 5,
    "Depression": 1,
    "Normal": 0,
    "Other": 6,
    "Stress": 3,
    "Suicidal": 4
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.6",
  "vocab_size": 30522
}
